001.codedFunctionObject/codedCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.5;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           5;

functions
{
    flows
    {
        type                coded;
        name                flows;
        libs                (utilityFunctionObjects);

        codeExecute
        #{
            Info << "Running code execute" << endl;

            const surfaceScalarField& phi = mesh().lookupObject<surfaceScalarField>("phi");
            forAll(phi.boundaryField(), patchI)
            {
                const fvPatch& patch = phi.boundaryField()[patchI].patch();
                const scalarField& pphi =  phi.boundaryField()[patchI];
                if (!(patch.name()=="inlet" || patch.name()=="outlet1" || patch.name()=="outlet2")) continue;
                Info << "    sum(" << patch.name() << ") of phi = " << gSum(pphi) << endl;
            }
        #};
    }
}

// ************************************************************************* //
